#از کاربر میپرسیم ایا بازی شروع بشه یا نه
#اگر کاربر بگه بله دو تا عدد رندوم باید تولید شه و پرینت شه
#گر کاربر بگه نه یک پیام به کاربر نمایش داده شه و بازی تمام شه
#حالت سوم هر چی به غیر از این ها بود بگه انتخاب اشتباه و از اول بپرسه

import random 
#از این لایبرری برای تولید رندوم استفاده میکنیم

while True :
    #تا وقتی که شرط درسته این لوپ تکرار میشه
    choice = input(' آیا میخواهید تاس بریزید ؟ بله یا خیر :')
    if choice  == 'بله':
    #دو بار باید تاس بریزیم پس دو تا عدد باید رندوم ساخته شه
        dice1 = random.randint(1, 6)
        dice2 = random.randint(1, 6)
        print(dice1,' ' , dice2 )
        
    elif choice == 'خیر':
        print('خدا نگهدار ')
        break
    
    else:
        print('لطفا ورودی صحیح انتخاب کنید !! ')
    
