#برنامه‌ای بنویسید که 10 بار ارتفاع پرش ورزشکار را دریافت کند.
#اگر رکورد جدید بود، پیام «بیشترین پرش ثبت شد» نمایش داده شود
#اگر قبلاً ثبت شده بود، پیام مناسب چاپ شود.

record = float ( input('ارتقاع پرش انجام شده را ثبت کنید : '))
print('اولین رگورد ثبت شده :',record,' است')
i = 2
#iشمارش گر است

while i <=10:
    jump = float (input('لطفا ارتفاع پرش ثبت شده را وارد کنید'))
    if jump > record:
        record = jump
        print('بلند ترین پرش ثبت شده ',record,' است')
        
    else:
        print('پرش قبلا ثبت شده یا رکورد تکراری است')
    i+=1
    
print('بهترین رکورد ثبت شده ',record,'است')