#بررسی رنگ‌ها
#سه رنگ از کاربر دریافت کنید.

#اگر دو رنگ برابر بودند، پیام مناسب نمایش داده شود.
#اگر سه رنگ برابر بودند، پیام جداگانه نمایش داده شود.
#در غیر این صورت اعلام شود که رنگ‌ها یکسان نیستند.

color1 = input ('لطفا رنگ اول را وارد کنید : ')
color2 = input ('لطفا رنگ دوم را وارد کنید : ')
color3 = input ('لطفا رنگ سوم را وارد کنید : ')
if color1 == color2 == color3:
    print('هر سه رنگ برابر هستند')
elif color1 == color2 or color1 == color3 or color2 == color3:
    print('دو رنگ با هم برابر هستند')
else:
    print('هیچ یک با هم برابر نیستند ')