#موجودی حساب و مبلغ برداشت را دریافت کنید.

#اگر موجودی کافی بود، عملیات انجام شود.
#اگر موجودی کافی نبود، پیام خطا نمایش داده شود.
#اگر مبلغ منفی یا صفر بود، پیام خطا چاپ شود.

balance = float(input('لطفا موجودی خود را اعلام کنید : '))
withdraw = float(input('لطفا مبلغ مد نظر خود را جهت برداشت وارد کنید : '))
if withdraw <=0 :
    print('مبلغ وارد شده صحیح نمیباشد')
elif withdraw > balance :
    print('مبلغ درخواستی شما بیشتر از موجودی میباشد ')
    
else:
    print('عملیات انجام شد :)')
balance = balance - withdraw 
print('موجودی شما ',balance,' میباشد')