#برنامه ای بنویسید که کامپیوتر یک عدد تصادفی تولید کند . کاربر عدد ان را حدس بزند.اگر کاربر عدد بزرگتر از عدد تولید کامپیوتر نوشت برنامه پیام دهد که عدد کوچکتر کن.
#اگر کاربر عدد کوچکتر از عدد تولید شده ی کامپیوتر نوشت برنامه پیام دهد که عدد را بزرگ تر کن و اگر دو عدد برابر باشند پیام تبریک دهد و بازی متوقف شود

import random 

computer_number = random.randint(1,100)

while True:
    user_number = int (input( ' یک عدد از بین 1 تا 100 حدس بزن'))
    if user_number > computer_number :
        print('عدد کوچکتر بگو ')
    elif user_number < computer_number:
        print(' عدد بزرگتر حدس بزن ')
    
    else :
        print('تبریک میگم. عدد درست را حدس زدید  ')
        break